.audit/pd-sweep-validation/test-hardening/gap-a-dw-121-122/mutation-duplicate-last-match.diff
diff --git a/convex/complianceNotes.ts b/convex/complianceNotes.ts
index 45f352a..375cb10 100644
--- a/convex/complianceNotes.ts
+++ b/convex/complianceNotes.ts
@@ -29,6 +29,7 @@ export async function selectedCandidateRunId(
     .withIndex("by_generationId_and_candidateId", (q) =>
       q.eq("generationId", generation._id).eq("candidateId", selection.candidateId)
     )
+    .order("desc")
     .first();
   return run?._id;
 }
