.audit/pd-sweep-validation/test-hardening/gap-a-dw-121-122/mutation-ownership-both.diff
diff --git a/convex/generations.ts b/convex/generations.ts
index 9b74d5a..1f27c96 100644
--- a/convex/generations.ts
+++ b/convex/generations.ts
@@ -4421,7 +4421,7 @@ export const getOrderedSectionDrafts = query({
     let explicitCandidateRun: Doc<"generationCandidateRuns"> | undefined;
     if (candidateRunId !== undefined) {
       const candidateRun = await ctx.db.get(candidateRunId);
-      if (!candidateRun || candidateRun.generationId !== generation._id) return [];
+      if (!candidateRun) return [];
       explicitCandidateRun = candidateRun;
     }
     const rows = (
@@ -4438,7 +4438,6 @@ export const getOrderedSectionDrafts = query({
             .take(30)
     ).filter(
       (row) =>
-        row.generationId === generation._id &&
         row.candidateRunId !== undefined &&
         (candidateRunId === undefined || row.candidateRunId === candidateRunId)
     );
