.audit/pd-sweep-validation/test-hardening/gap-a-dw-121-122/mutation-parent-run-generation-check.diff
diff --git a/convex/generations.ts b/convex/generations.ts
index 9b74d5a..6870d7e 100644
--- a/convex/generations.ts
+++ b/convex/generations.ts
@@ -4421,7 +4421,7 @@ export const getOrderedSectionDrafts = query({
     let explicitCandidateRun: Doc<"generationCandidateRuns"> | undefined;
     if (candidateRunId !== undefined) {
       const candidateRun = await ctx.db.get(candidateRunId);
-      if (!candidateRun || candidateRun.generationId !== generation._id) return [];
+      if (!candidateRun) return [];
       explicitCandidateRun = candidateRun;
     }
     const rows = (
